// src/content/fa.ts
import type { LanguageContent } from "./TypesContent";

const fa: LanguageContent = {
  languageToggle: {
    fa: "فارسی",
    en: "English",
  },

  navbar: {
    home: "خانه",
    products: "محصولات",
    about: "درباره ما",
    logo: "فروشگاه شهریار",
  },

  home: {
    title: "فروشگاه قطعات صنعتی و کشاورزی شهریار",
    description: `فروشگاه شهریار با سال‌ها تجربه در تأمین قطعات تراکتور و ماشین‌آلات صنعتی، به‌عنوان یکی از مراکز تخصصی کشور، آماده خدمت‌رسانی به کشاورزان، تعمیرکاران، شرکت‌های صنعتی و فروشگاه‌های قطعات یدکی در سراسر ایران است.

ما مجموعه‌ای کامل از قطعات یدکی اصلی و سفارشی، خدمات مشاوره فنی، طراحی صنعتی، و ارسال سریع را با بالاترین کیفیت ارائه می‌دهیم. تمامی قطعات با ضمانت اصالت و کیفیت عرضه می‌شوند و از تولیدکنندگان معتبر جهانی تأمین شده‌اند.

تیم فنی ما با دانش تخصصی و تجربه عملی، آماده پاسخ‌گویی به سوالات شما و ارائه راهکارهای دقیق برای انتخاب قطعه مناسب است. همچنین امکان ثبت سفارش خاص، مشاوره در زمینه بهینه‌سازی عملکرد ماشین‌آلات، و دریافت پیشنهادات فنی وجود دارد.

کیفیت بالا، قیمت منصفانه، پشتیبانی واقعی، و تعهد به رضایت مشتری، اصولی هستند که همیشه به آن‌ها پایبندیم. هدف ما ایجاد اعتماد، تسهیل فرآیند خرید، و ارتقاء بهره‌وری در صنعت کشاورزی و مکانیک کشور است.

اگر به دنبال قطعه‌ای خاص هستید، یا نیاز به راهنمایی فنی دارید، با افتخار در کنار شما هستیم.`,
    image_alt: "قطعه تراکتور سفارشی",
  },

  footer: {
    copyright: `© ${new Date().getFullYear()} فروشگاه شهریار`,
    credit: "طراحی و توسعه توسط سروش ایلیات",
    address_title: "آدرس فروشگاه",
    address_full:
      "میدان امام خمینی، خیابان ناصرخسرو، کوچه پست، پاساژ ناصرخسرو، طبقه ۳، پلاک ۵",
    office: "دفتر",
    office_tel: "۰۲۱-۳۳۹۶۹۸۸۴",
    mobile: "موبایل و واتساپ",
    mobile_tel: "۰۹۱۲۵۲۴۱۳۹۹",
    email: "Gmail",
    email_adress: "soroushiliyat23@gmail.com",
  },

  aboutUs: {
    title: "درباره فروشگاه شهریار",
    description:
      "فروشگاه شهریار با بیش از ۲۰ سال تجربه در تأمین و توزیع قطعات صنعتی تراکتور، افتخار دارد که محصولات خود را از معتبرترین تولیدکنندگان جهانی وارد می‌کند...",
    features: [
      "واردات مستقیم از چین، هند و ترکیه",
      "تضمین اصالت و کیفیت قطعات",
      "ارسال سریع به سراسر کشور",
      "پشتیبانی فنی و مشاوره تخصصی",
    ],
    mission:
      "... مأموریت ما توسعه زیرساخت کشاورزی ایران با تأمین قطعات مطمئن و صنعتی است",
    countriesTitle: "واردکننده قطعات از کشورهای زیر",
    countries: [
      { name: "چین", code: "CN" },
      { name: "هند", code: "IN" },
      { name: "ترکیه", code: "TR" },
    ],
  },

  products: {
    title: "لیست قطعات تراکتور",
    noProducts: "قطعه‌ای یافت نشد",
    items: [
      "لاستیک عقب تراکتور",
      "صندلی فنردار راننده",
      "خار نگهدارنده میل‌لنگ",
      "فیلتر هوا صنعتی",
      "واشر حرارتی موتور",
      "چراغ جلو تراکتور",
    ],
  },
};

export default fa;
